backend_rails/app/controllers/leads_controller.rb

SELECT "leads".* FROM "leads"
---
    def index
        leads = Lead.all

INSERT INTO "leads" ("client_id", "user_id", "vehicle_id", "note", "closed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["client_id", 112], ["user_id", 31], ["vehicle_id", 21], ["note", "Im bougie"], ["closed", false], ["created_at", "2020-03-05 15:14:20.922528"], ["updated_at", "2020-03-05 15:14:20.922528"]]
---
    def create
        lead = Lead.create(leadParams)

SELECT "leads".* FROM "leads" WHERE "leads"."id" = $1 LIMIT $2  [["id", 202], ["LIMIT", 1]]
DELETE FROM "leads" WHERE "leads"."id" = $1  [["id", 21]]
---
    def destroy
        lead = Lead.find(params[:id])
        lead.destroy