backend_rails/app/controllers/sales_controller.rb

INSERT INTO "sales" ("user_id", "client_id", "vehicle_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["client_id", 30], ["vehicle_id", 12], ["created_at", "2020-03-04 21:32:22.056935"], ["updated_at", "2020-03-04 21:32:22.056935"]]
---
    def create
        Sale.create(saleParams)