backend_rails/app/controllers/users_controller.rb

    def update
        user = User.find(userParams[:id].to_i)
        newSales = user.total_sales + userParams[:total_sales].to_i
        newCarsSoldAmount = user.cars_sold + 1
        user.update(total_sales: newSales)
        user.update(cars_sold: newCarsSoldAmount)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "total_sales" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["total_sales", 86249], ["updated_at", "2020-03-04 23:08:11.966297"], ["id", 9]]
UPDATE "users" SET "cars_sold" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["cars_sold", 71], ["updated_at", "2020-03-04 23:08:11.974183"], ["id", 9]]