backend_rails/app/controllers/vehicles_controller.rb

    def index
        vehicles = Vehicle.all
---
SELECT "vehicles".* FROM "vehicles"

    def show
        vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        newVehicle = Vehicle.create(vehicleParams)
---
INSERT INTO "vehicles" ("make", "model", "trim", "vin", "color", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["make", ""], ["model", ""], ["trim", ""], ["vin", ""], ["color", ""], ["description", ""], ["created_at", "2020-03-04 13:53:04.766146"], ["updated_at", "2020-03-04 13:53:04.766146"]]

    def update
        newVehicle = Vehicle.find(vehicleParamsForUpdate[:id])
        newVehicle.update(vehicleParamsForUpdate)
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "vehicles" SET "trim" = $1, "color" = $2, "vin" = $3, "description" = $4, "updated_at" = $5 WHERE "vehicles"."id" = $6  [["trim", "null"], ["color", "Silver"], ["vin", "null"], ["description", "null"], ["updated_at", "2020-03-04 18:35:03.810564"], ["id", 46]]

    def destroy
        newVehicle = Vehicle.find(params[:id])
        newVehicle.destroy
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "vehicles" WHERE "vehicles"."id" = $1  [["id", 24]]